In [1]:
import sqlite3

In [2]:
#connect to an SQLite database
connection = sqlite3.connect('example.db')

In [3]:
cursor = connection.cursor()

In [4]:
#create a table
cursor.execute('''
CREATE TABLE IF NOT EXISTS employees(
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER,
    department TEXT
)
''')

#commit the changes
connection.commit()

In [5]:
cursor.execute('''
SELECT * FROM employees
''')

In [6]:
#imsert the data in sqlite table
cursor.execute(
'''
Insert Into employees(name, age, department)
            values('Krish', 32,'Data Scientist')
            ,('John', 28,'Software Engineer'),
            ('Sarah', 35,'Product Manager')
'''    
)

connection.commit()

In [7]:
#query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()
#print the queried data
for row in rows:
    print(row)

(1, 'Krish', 34, 'Data Scientist')
(2, 'John', 28, 'Software Engineer')
(3, 'Sarah', 35, 'Product Manager')
(4, 'Krish', 34, 'Data Scientist')
(5, 'John', 28, 'Software Engineer')
(6, 'Sarah', 35, 'Product Manager')
(7, 'Krish', 34, 'Data Scientist')
(8, 'John', 28, 'Software Engineer')
(9, 'Sarah', 35, 'Product Manager')
(10, 'Krish', 32, 'Data Scientist')
(11, 'John', 28, 'Software Engineer')
(12, 'Sarah', 35, 'Product Manager')

In [8]:
#update the data in the table
cursor.execute('''
UPDATE employees
SET age = 34
WHERE name="Krish"
''')

connection.commit()

In [9]:
cursor.execute('''
SELECT * FROM employees
''')
rows=cursor.fetchall()
for row in rows:
    print(row)

(1, 'Krish', 34, 'Data Scientist')
(2, 'John', 28, 'Software Engineer')
(3, 'Sarah', 35, 'Product Manager')
(4, 'Krish', 34, 'Data Scientist')
(5, 'John', 28, 'Software Engineer')
(6, 'Sarah', 35, 'Product Manager')
(7, 'Krish', 34, 'Data Scientist')
(8, 'John', 28, 'Software Engineer')
(9, 'Sarah', 35, 'Product Manager')
(10, 'Krish', 34, 'Data Scientist')
(11, 'John', 28, 'Software Engineer')
(12, 'Sarah', 35, 'Product Manager')

In [10]:
#delete data
cursor.execute('''
DELETE from employees
WHERE name = 'John'
''')

connection.commit()

In [11]:
cursor.execute('''
SELECT * FROM employees
''')
rows=cursor.fetchall()
for row in rows:
    print(row)

(1, 'Krish', 34, 'Data Scientist')
(3, 'Sarah', 35, 'Product Manager')
(4, 'Krish', 34, 'Data Scientist')
(6, 'Sarah', 35, 'Product Manager')
(7, 'Krish', 34, 'Data Scientist')
(9, 'Sarah', 35, 'Product Manager')
(10, 'Krish', 34, 'Data Scientist')
(12, 'Sarah', 35, 'Product Manager')

In [ ]:
cursor.executemany('''
Insert into sales(date, product,)
''')